In [2]:
import pandas as pd
import re
import numpy as np
import random

In [3]:
s = pd.Series(['X', 'Y', 'Z', 'Aaba', 'Baca', np.nan, 'CABA', None, 'bird', 'horse', 'dog'])

In [4]:
#converting all elements in series to uppercase
s.str.upper()

0         X
1         Y
2         Z
3      AABA
4      BACA
5       NaN
6      CABA
7      None
8      BIRD
9     HORSE
10      DOG
dtype: object

In [5]:
#convert all elements in series to lowercase
s.str.lower()

0         x
1         y
2         z
3      aaba
4      baca
5       NaN
6      caba
7      None
8      bird
9     horse
10      dog
dtype: object

In [6]:
#finding length of each elem in series
s.str.len()

0     1.0
1     1.0
2     1.0
3     4.0
4     4.0
5     NaN
6     4.0
7     NaN
8     4.0
9     5.0
10    3.0
dtype: float64

In [7]:
color1 = pd.Index([' Green', 'Black ', ' Red ', 'White', ' Pink '])

In [8]:
#rstrip for stripping right side
color1.str.rstrip()

Index([' Green', 'Black', ' Red', 'White', ' Pink'], dtype='object')

In [9]:
#lstrip for stripping left side
color1.str.lstrip()

Index(['Green', 'Black ', 'Red ', 'White', 'Pink '], dtype='object')

In [10]:
#stripping both sides..
color1.str.strip()

Index(['Green', 'Black', 'Red', 'White', 'Pink'], dtype='object')

In [11]:
#adding leading zeroes to the given data
nums = {'amount': [10, 250, 3000, 40000, 500000]}
df=pd.DataFrame(nums)

In [12]:
df

   amount
0      10
1     250
2    3000
3   40000
4  500000

In [13]:
df['amount']=df['amount'].apply(lambda x:'{0:0>8}'.format(x))

In [14]:
df

     amount
0  00000010
1  00000250
2  00003000
3  00040000
4  00500000

In [15]:
#adding leading zeroes to the string
nums = {'amount': ['10', '250', '3000', '40000', '500000']}
df=pd.DataFrame(nums)
df['amount']=df['amount'].apply(lambda x :x.zfill(10))
#df['amount']=df['amount'].apply(lambda x :'{0:0>10}'.format(x))

In [16]:
df

       amount
0  0000000010
1  0000000250
2  0000003000
3  0000040000
4  0000500000

In [17]:
'{0:0>8}'.format('10')

'00000010'

In [18]:
df = pd.DataFrame({
    'name': ['alberto','gino','ryan', 'Eesha', 'syed'],
    'date_of_birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})

In [19]:
df['name']=df['name'].apply(lambda x:x.title())

In [20]:
df

      name date_of_birth    age
0  Alberto     17/05/2002  18.5
1     Gino     16/02/1999  21.2
2     Ryan     25/09/1998  22.5
3    Eesha     11/05/2002  22.0
4     Syed     15/09/1997  23.0

In [21]:
len(re.findall(r'[aeiou]','upendrareddyguduru'))

7

In [22]:
#counting vowels in the elements (case Insensitive)
df['count']=df['name'].apply(lambda x:len(re.findall('[aeiou]',x,re.I)))#for case sensitive remove re.I

In [23]:
df

      name date_of_birth    age  count
0  Alberto     17/05/2002  18.5      3
1     Gino     16/02/1999  21.2      2
2     Ryan     25/09/1998  22.5      1
3    Eesha     11/05/2002  22.0      3
4     Syed     15/09/1997  23.0      1

In [24]:
'skjf'.isalnum()

True

In [25]:
df = pd.DataFrame({
    'company_code': ['Company','Company a001','Company 123', 'abcd', 'Company 12'],
    'date_of_sale ': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]})

In [26]:
df

   company_code date_of_sale   sale_amount
0       Company    12/05/2002      12348.5
1  Company a001    16/02/1999     233331.2
2   Company 123    25/09/1998         22.5
3          abcd    12/02/2022    2566552.0
4    Company 12    15/09/1997         23.0

In [27]:
df['Company_code_is_alpha']=list(map(lambda x:x.isalpha() ,df['company_code']))
#simply .isdigit() is used to check whether string has only digits

In [28]:
df

   company_code date_of_sale   sale_amount  Company_code_is_alpha
0       Company    12/05/2002      12348.5                   True
1  Company a001    16/02/1999     233331.2                  False
2   Company 123    25/09/1998         22.5                  False
3          abcd    12/02/2022    2566552.0                   True
4    Company 12    15/09/1997         23.0                  False

In [29]:
'Up d'.istitle()

False

In [30]:
#len of the strings of each row in the particular column
df['company_code_length']=df['company_code'].apply(len)

In [31]:
df

,company_code,date_of_sale,sale_amount,Company_code_is_alpha,company_code_length
0,Company,12/05/2002,12348.5,True,7
1,Company a001,16/02/1999,233331.2,False,12
2,Company 123,25/09/1998,22.5,False,11
3,abcd,12/02/2022,2566552.0,True,4
4,Company 12,15/09/1997,23.0,False,10

In [32]:
#len of the strings of each row in the particular column
df['company_code_length']=df['sale_amount'].apply(lambda x: len(str(x)))
# ""                             ""        .map(str).apply(len)

In [33]:
df

,company_code,date_of_sale,sale_amount,Company_code_is_alpha,company_code_length
0,Company,12/05/2002,12348.5,True,7
1,Company a001,16/02/1999,233331.2,False,8
2,Company 123,25/09/1998,22.5,False,4
3,abcd,12/02/2022,2566552.0,True,9
4,Company 12,15/09/1997,23.0,False,4

In [34]:
'dskj jld'.capitalize()

'Dskj jld'

In [35]:
df=df.replace('a001','A')#used to replace particular full string 
#to replace more values use lists
df=df.replace(['df','dff'],['j','u'])

In [36]:
df

,company_code,date_of_sale,sale_amount,Company_code_is_alpha,company_code_length
0,Company,12/05/2002,12348.5,True,7
1,Company a001,16/02/1999,233331.2,False,8
2,Company 123,25/09/1998,22.5,False,4
3,abcd,12/02/2022,2566552.0,True,9
4,Company 12,15/09/1997,23.0,False,4

In [37]:
df = pd.DataFrame({
    'name': ['Alberto  Franco','Gino Ann Mcneill','Ryan  Parkes', 'Eesha Artur Hinton', 'Syed  Wharton'],
    'date_of_birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})
print("Original DataFrame:")
print(df)

Original DataFrame:
                 name date_of_birth    age
0     Alberto  Franco     17/05/2002  18.5
1    Gino Ann Mcneill     16/02/1999  21.2
2        Ryan  Parkes     25/09/1998  22.5
3  Eesha Artur Hinton     11/05/2002  22.0
4       Syed  Wharton     15/09/1997  23.0

In [38]:
#splitting name into first last middle and last names
df[['first_name','middle_name','last_name']]=df['name'].str.split(" ",expand=True)

In [39]:
df

                 name date_of_birth    age first_name middle_name last_name
0     Alberto  Franco     17/05/2002  18.5    Alberto                Franco
1    Gino Ann Mcneill     16/02/1999  21.2       Gino         Ann   Mcneill
2        Ryan  Parkes     25/09/1998  22.5       Ryan                Parkes
3  Eesha Artur Hinton     11/05/2002  22.0      Eesha       Artur    Hinton
4       Syed  Wharton     15/09/1997  23.0       Syed               Wharton

In [40]:
df = pd.DataFrame({
    'name_email': ['Alberto Franco af@gmail.com_klk','Gino Mcneill gm@yahoo.com23','Ryan Parkes rp@abc.io', 'Eesha Hinton', 'Gino Mcneill gm@github.com']
    })

In [41]:
def find_email(text):
    l=re.findall(r'[\w.-]+@[a-z.-]+',str(text))
    return "".join(l)

In [42]:
df['mail']=df['name_email'].apply(lambda x: find_email(x))

In [43]:
df

                        name_email           mail
0  Alberto Franco af@gmail.com_klk   af@gmail.com
1      Gino Mcneill gm@yahoo.com23   gm@yahoo.com
2            Ryan Parkes rp@abc.io      rp@abc.io
3                     Eesha Hinton
4       Gino Mcneill gm@github.com  gm@github.com

In [44]:
#finding hashword in the tweets
df = pd.DataFrame({
    'tweets': ['#Obama says goodbye','Retweets for #cash','A political endorsement in #Indonesia', '1 dog = many #retweets', 'Just a simple #egg']
    })

In [45]:
df

                                  tweets
0                    #Obama says goodbye
1                     Retweets for #cash
2  A political endorsement in #Indonesia
3                 1 dog = many #retweets
4                     Just a simple #egg

In [46]:
def find_hash(text):
    s=re.findall(r'(?<=#)\w+',str(text))
    return ''.join(s)
df['tags']=df['tweets'].apply(lambda x:find_hash(x))

In [47]:
df

                                  tweets       tags
0                    #Obama says goodbye      Obama
1                     Retweets for #cash       cash
2  A political endorsement in #Indonesia  Indonesia
3                 1 dog = many #retweets   retweets
4                     Just a simple #egg        egg

In [48]:
df = pd.DataFrame({
    'company_code': ['c0001','c0002','c0003', 'c0003', 'c0004'],
    'address': ['7277 Surre7889y Ave.','920 N. Bishop Ave.','9910 Golden Star St.', '25 Dunbar St.', '17 West Livingston Court']
    })

In [49]:
def find_num(text):
    s=re.findall(r'[0-9]',str(text))
    return ''.join(s)
df['num']=df['address'].apply(lambda x:find_num(x))

In [50]:
df

  company_code                   address       num
0        c0001      7277 Surre7889y Ave.  72777889
1        c0002        920 N. Bishop Ave.       920
2        c0003      9910 Golden Star St.      9910
3        c0003             25 Dunbar St.        25
4        c0004  17 West Livingston Court        17

In [63]:
df = pd.DataFrame({
    'company_code': ['c0001','c0002','c0003', 'c00031', 'c0004','c0005','c0006','c0007','c0008'],
    'year': ['year 1800','year 1700','year 2300', 'year 1900', 'year 2200','year 2023','year 2000','year 1999','year 2020']
    })

In [64]:
#finding year in range(1800-2022)
def find_year(text):
    s=re.findall(r'18[0-9]{2}|19[0-9]{2}|20[02]{2}',text)
    return ''.join(s)

In [65]:
df['1800-2022']=df['year'].apply(lambda x:find_year(x))

In [66]:
df

  company_code       year 1800-2022
0        c0001  year 1800      1800
1        c0002  year 1700
2        c0003  year 2300
3       c00031  year 1900      1900
4        c0004  year 2200
5        c0005  year 2023
6        c0006  year 2000      2000
7        c0007  year 1999      1999
8        c0008  year 2020      2020

In [83]:
#extracting non alphanumeric characters in a given df
df = pd.DataFrame({
    'company_code': ['c0001#','c00@0^2','$c0003', 'c0003', '&c0004'],
    'year': ['year 1800','year 1700','year 2300', 'year 1900', 'year 2200']
    })

In [87]:
def find_naln(text):
    r=re.findall(r'[^\w]',str(text))
    return "".join(r)

In [88]:
df['nonalpanums']=df['company_code'].apply(lambda x:find_naln(x))

In [89]:
df

  company_code       year nonalpanums
0       c0001#  year 1800           #
1      c00@0^2  year 1700          @^
2       $c0003  year 2300           $
3        c0003  year 1900
4       &c0004  year 2200           &